tests-artillery-produccion-post/carga-alta.yml
# carga-alta.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 100
    - duration: 20
      arrivalRate: 300
    - duration: 20
      arrivalRate: 600

scenarios:
  - name: Test registrar producción carga alta
    flow:
      - post:
          url: "/auth/login"
          json:
            nombre_usuario: "Instructor"
            password: "admin123"
          capture:
            - json: "$.access_token"
              as: "token"
      - post:
          url: "/produccion"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            id_lote: 1
            fecha: "2026-08-13"
            huevos_buenos: 100
            huevos_rotos: 5